In [3]:
####### Example code for Tinu and Tara 
## Exercise 1: import necessary libraries to carry out analysis using pandas and to visualise the dataset
# Ensure that the pandas is downloaded 'pip install pandas'
import pandas as pd
# Ensure that the matplotlib is downloaded 'pip install matplotlib'
import matplotlib as plt
# Ensure that the matplotlib is downloaded 'pip install numpy'
import numpy as np

df = pd.read_csv('Dataset /brazilian_amazon_fires_1999_2019.csv')


## Exercise 2: Load the data and display the first few rows
df.head(10) # This outputs the first 10 rows -

   year  month        state   latitude  longitude  firespots
0  1999      1     AMAZONAS  -2.371113 -59.899933          3
1  1999      1     MARANHAO  -2.257395 -45.487831         36
2  1999      1  MATO GROSSO -12.660633 -55.057989         18
3  1999      1         PARA  -2.474820 -48.546967         87
4  1999      1     RONDONIA -12.861700 -60.513100          1
5  1999      1      RORAIMA   3.403225 -60.622853         15
6  1999      2        AMAPA  -0.155000 -52.683100          1
7  1999      2     AMAZONAS  -2.763167 -63.429781         43
8  1999      2  MATO GROSSO -12.619988 -55.375363          8
9  1999      2         PARA  -2.150617 -53.509911        285

In [4]:
# Display basic summary statistics and check for missing values
df.describe()

              year        month     latitude    longitude     firespots
count  2104.000000  2104.000000  2104.000000  2104.000000   2104.000000
mean   2009.267110     6.704848    -5.439282   -56.510314   1167.417776
std       5.963029     3.431949     4.852439     7.382619   2959.558714
min    1999.000000     1.000000   -14.431908   -73.085000      1.000000
25%    2004.000000     4.000000    -9.946974   -62.376004     16.000000
50%    2009.000000     7.000000    -5.808292   -55.876480    121.000000
75%    2014.000000    10.000000    -2.595169   -50.396154    755.000000
max    2019.000000    12.000000     4.151000   -44.188000  37926.000000

In [21]:
# Check for missing data 
df.isnull() # Checks for null values- this outputs a boolean value (True/False)
df.notnull() #Checks for values that are nonf null - this outputs a boolean value (True/False)

print(df.isnull().sum())
print(df.notnull().sum())

year         0
month        0
state        0
latitude     0
longitude    0
firespots    0
dtype: int64
year         2104
month        2104
state        2104
latitude     2104
longitude    2104
firespots    2104
dtype: int64

In [24]:
# Exercise 4: Exploratory Data Analysis - Count of firespots by state

df["firespots"].sum() # This finds the sum of all the firespots within the whole data set


#Analyze the distribution of firespots across different states.

#grouping data by state and summing the number of fires
state = df.groupby(df['state'])['firespots'].sum() # Dataframw group by state and 

print(state)

state
ACRE           126471
AMAPA           39337
AMAZONAS       188483
MARANHAO       160543
MATO GROSSO    595378
PARA           942283
RONDONIA       340517
RORAIMA         46981
TOCANTINS       16254
Name: firespots, dtype: int64